Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_sec_eng.c
    high = (shaCtx->total[0] >> 29) | (shaCtx->total[1] << 3);
    low = (shaCtx->total[0] << 3);

    PUT_UINT32_BE(high, msgLen, 0);
    PUT_UINT32_BE(low, msgLen, 4);

    last = shaCtx->total[0] & 0x3F;
    padn = (last < 56) ? (56 - last) : (120 - last);

    Sec_Eng_SHA256_Update(shaCtx, shaNo, (uint8_t *)shaCtx->shaPadding, padn);

    /* Wait for  shaPadding idle */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

    BL602_MemCpy_Fast(shaCtx->shaPadding, msgLen, 8);
    Sec_Eng_SHA256_Update(shaCtx, shaNo, (uint8_t *)shaCtx->shaPadding, 8);

    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_BUSY));

    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
    shaMode = (SEC_ENG_SHA_Type)BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE);
    /* Copy SHA value */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_0);
    *p++ = (tmpVal & 0xff);
    *p++ = ((tmpVal >> 8) & 0xff);
    *p++ = ((tmpVal >> 16) & 0xff);
    *p++ = ((tmpVal >> 24) & 0xff);
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_1);
    *p++ = (tmpVal & 0xff);
    *p++ = ((tmpVal >> 8) & 0xff);
    *p++ = ((tmpVal >> 16) & 0xff);
    *p++ = ((tmpVal >> 24) & 0xff);
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_2);
    *p++ = (tmpVal & 0xff);
    *p++ = ((tmpVal >> 8) & 0xff);
    *p++ = ((tmpVal >> 16) & 0xff);
    *p++ = ((tmpVal >> 24) & 0xff);
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_3);
    *p++ = (tmpVal & 0xff);
    *p++ = ((tmpVal >> 8) & 0xff);
    *p++ = ((tmpVal >> 16) & 0xff);
    *p++ = ((tmpVal >> 24) & 0xff);
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_4);
    *p++ = (tmpVal & 0xff);
    *p++ = ((tmpVal >> 8) & 0xff);
    *p++ = ((tmpVal >> 16) & 0xff);
    *p++ = ((tmpVal >> 24) & 0xff);

    if (shaMode == SEC_ENG_SHA224 || shaMode == SEC_ENG_SHA256) {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_5);
        *p++ = (tmpVal & 0xff);
        *p++ = ((tmpVal >> 8) & 0xff);
        *p++ = ((tmpVal >> 16) & 0xff);
        *p++ = ((tmpVal >> 24) & 0xff);
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_6);
        *p++ = (tmpVal & 0xff);
        *p++ = ((tmpVal >> 8) & 0xff);
        *p++ = ((tmpVal >> 16) & 0xff);
        *p++ = ((tmpVal >> 24) & 0xff);

        if (shaMode == SEC_ENG_SHA256) {
            tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_HASH_L_7);
            *p++ = (tmpVal & 0xff);
            *p++ = ((tmpVal >> 8) & 0xff);
            *p++ = ((tmpVal >> 16) & 0xff);
            *p++ = ((tmpVal >> 24) & 0xff);
        }
    }

    /* Disable SHA engine*/
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_HASH_SEL);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_EN);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SHA enable link mode and set link config address
 *
 * @param  shaNo: SHA ID type
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_SHA_Enable_Link(SEC_ENG_SHA_ID_Type shaNo)
{
    uint32_t SHAx = SEC_ENG_BASE;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

    /* Enable sha and enable link mode */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_LINK_MODE);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  SHA disable link mode
 *
 * @param  shaNo: SHA ID type
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_SHA_Disable_Link(SEC_ENG_SHA_ID_Type shaNo)
{
    uint32_t SHAx = SEC_ENG_BASE;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

    /* Disable sha and disable link mode */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_LINK_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_EN);
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  SHA256 link mode initialization function
 *
 * @param  shaCtx: SHA256 link mode context pointer
 * @param  shaNo: SHA ID type
 * @param  linkAddr: SHA link configure address
 * @param  shaTmpBuf[16]: SHA temp buffer for store data that is less than 64 bytes
 * @param  padding[16]: SHA padding buffer for store padding data
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_SHA256_Link_Init(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr, uint32_t shaTmpBuf[16], uint32_t padding[16])
{
    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

    /* Clear context */
    memset(shaCtx, 0, sizeof(SEC_Eng_SHA256_Link_Ctx));

    /* Init temp buffer,padding buffer and link address */
    shaCtx->shaBuf = shaTmpBuf;
    shaCtx->shaPadding = padding;
    BL602_MemSet(shaCtx->shaPadding, 0, 64);
    BL602_MemSet(shaCtx->shaPadding, 0x80, 1);
    shaCtx->linkAddr = linkAddr;

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(SEC_SHA_IRQn, SEC_SHA_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  SHA256 link mode update input data function
 *
 * @param  shaCtx: SHA256 link mode context pointer
 * @param  shaNo: SHA ID type
 * @param  input: SHA input data pointer, and the address should be word align
 * @param  len: SHA input data length
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_SHA256_Link_Update(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, const uint8_t *input, uint32_t len)
{
    uint32_t SHAx = SEC_ENG_BASE;
    uint32_t tmpVal;
    uint32_t fill;
    uint32_t left;
    uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    if (len == 0) {
        return SUCCESS;
    }

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    /* Set link address */
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_LINK, shaCtx->linkAddr);

    left = shaCtx->total[0] & 0x3F;
    fill = 64 - left;

    shaCtx->total[0] += (uint32_t)len;
    shaCtx->total[0] &= 0xFFFFFFFF;

    if (shaCtx->total[0] < (uint32_t)len) {
        shaCtx->total[1]++;
    }

    if (left && len >= fill) {
        BL602_MemCpy_Fast((void *)((uint8_t *)shaCtx->shaBuf + left), input, fill);
        /* Set data source address */
        *(uint32_t *)(shaCtx->linkAddr + 4) = (uint32_t)shaCtx->shaBuf;

        /* Set data length */
        *((uint16_t *)shaCtx->linkAddr + 1) = 1;
        /* Trigger */
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

        /* Choose accumulating last hash in the next time */
        *((uint32_t *)shaCtx->linkAddr) |= 0x40;
        input += fill;
        len -= fill;
        left = 0;
    }

    fill = len / 64;
    len = len % 64;

    if (fill > 0) {
        /* Wait finished */
        timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

        do {
            tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

        /* Fill data */
        *(uint32_t *)(shaCtx->linkAddr + 4) = (uint32_t)input;
        *((uint16_t *)shaCtx->linkAddr + 1) = fill;

        /* Trigger */
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_SHA_0_TRIG_1T));

        input += (fill * 64);
        /* Choose accumulating last hash in the next time */
        *((uint32_t *)shaCtx->linkAddr) |= 0x40;
    }

    if (len > 0) {
        /* Wait finished */
        timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

        do {
            tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
            timeoutCnt--;

            if (timeoutCnt == 0) {
                return TIMEOUT;
            }
        } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

        /* Copy left data into temp buffer */
        BL602_MemCpy_Fast((void *)((uint8_t *)shaCtx->shaBuf + left), input, len);
    }

    /* Wait finished */
    timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SHA256 link mode finish to get output function
 *
 * @param  shaCtx: SHA256 link mode context pointer
 * @param  shaNo: SHA ID type
 * @param  hash: SHA output data of SHA result
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_SHA256_Link_Finish(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint8_t *hash)
{
    uint32_t last, padn;
    uint32_t high, low;
    uint8_t msgLen[8];
    uint32_t SHAx = SEC_ENG_BASE;
    uint32_t tmpVal;
    uint32_t shaMode = (*(uint32_t *)shaCtx->linkAddr) >> 2 & 0x7;
    uint32_t timeoutCnt = SEC_ENG_SHA_BUSY_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

    /* Wait finished */
    do {
        tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_SHA_0_BUSY));

    /* Set link address */
    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_0_LINK, shaCtx->linkAddr);

