Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_sec_eng.c
    /* Disable aes link mode */
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_CTRL);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_0_CTRL, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_LINK_MODE));
}

/****************************************************************************/ /**
 * @brief  AES work in link mode
 *
 * @param  aesNo: AES ID type
 * @param  linkAddr: Address of config structure in link mode
 * @param  in: AES input data buffer to deal with
 * @param  len: AES input data length
 * @param  out: AES output data buffer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_AES_Link_Work(SEC_ENG_AES_ID_Type aesNo, uint32_t linkAddr, const uint8_t *in, uint32_t len, uint8_t *out)
{
    uint32_t AESx = SEC_ENG_BASE;
    uint32_t tmpVal;
    uint32_t timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));

    /* Link address should word align */
    if ((linkAddr & 0x03) != 0 || len % 16 != 0) {
        return ERROR;
    }

    /* Wait finished */
    do {
        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_0_BUSY));

    /* Set link address */
    BL_WR_REG(AESx, SEC_ENG_SE_AES_0_LINK, linkAddr);

    /* Change source buffer address and destination buffer address */
    *(uint32_t *)(linkAddr + 4) = (uint32_t)in;
    *(uint32_t *)(linkAddr + 8) = (uint32_t)out;

    /* Set data length */
    *((uint16_t *)linkAddr + 1) = len / 16;

    /* Enable aes */
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_CTRL);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_EN));

    /* Start aes engine and wait finishing */
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_CTRL);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_0_CTRL, BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_TRIG_1T));
    __NOP();
    __NOP();
    timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_0_BUSY));

    /* Disable aes */
    BL_WR_REG(AESx, SEC_ENG_SE_AES_0_CTRL, BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_0_EN));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  AES set hardware key source:efuse region for CPU0  or region efuse for CPU1
 *
 * @param  aesNo: AES ID type
 * @param  src: AES key source type
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_AES_Set_Hw_Key_Src(SEC_ENG_AES_ID_Type aesNo, uint8_t src)
{
    uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));

    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_SBOOT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_SBOOT_KEY_SEL, src);

    BL_WR_REG(AESx, SEC_ENG_SE_AES_SBOOT, tmpVal);
}

/****************************************************************************/ /**
 * @brief  AES set KEY and IV
 *
 * @param  aesNo: AES ID type
 * @param  keySrc: AES KEY type:SEC_ENG_AES_KEY_HW or SEC_ENG_AES_KEY_SW
 * @param  key: AES KEY pointer
 * @param  iv: AES IV pointer
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_AES_Set_Key_IV(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Key_Src_Type keySrc, const uint8_t *key, const uint8_t *iv)
{
    uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
    uint32_t tmpVal;
    uint32_t keyType;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));
    CHECK_PARAM(IS_SEC_ENG_AES_KEY_SRC_TYPE(keySrc));

    /* Set IV */
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_3, __REV(BL_RDWD_FRM_BYTEP(iv)));
    iv += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_2, __REV(BL_RDWD_FRM_BYTEP(iv)));
    iv += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_1, __REV(BL_RDWD_FRM_BYTEP(iv)));
    iv += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_0, __REV(BL_RDWD_FRM_BYTEP(iv)));
    iv += 4;

    /* Select hardware key */
    if (keySrc == SEC_ENG_AES_KEY_HW) {
        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_HW);
        BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_0, *key);
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0, tmpVal);

        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_1, *key);
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1, tmpVal);

        return;
    }

    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_7, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_6, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_5, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_4, __REV(BL_RDWD_FRM_BYTEP(key)));
    key += 4;

    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    keyType = BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_MODE);

    if (keyType == (uint32_t)SEC_ENG_AES_KEY_192BITS) {
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_3, __REV(BL_RDWD_FRM_BYTEP(key)));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_2, __REV(BL_RDWD_FRM_BYTEP(key)));
        key += 4;
    } else if (keyType == (uint32_t)SEC_ENG_AES_KEY_256BITS || keyType == (uint32_t)SEC_ENG_AES_DOUBLE_KEY_128BITS) {
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_3, __REV(BL_RDWD_FRM_BYTEP(key)));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_2, __REV(BL_RDWD_FRM_BYTEP(key)));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_1, __REV(BL_RDWD_FRM_BYTEP(key)));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_0, __REV(BL_RDWD_FRM_BYTEP(key)));
        key += 4;
    }

    /* Select software key */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_SW);

