Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_sec_eng.c
    BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  AES set KEY and IV with bigendian
 *
 * @param  aesNo: AES ID type
 * @param  keySrc: AES KEY type:SEC_ENG_AES_KEY_HW or SEC_ENG_AES_KEY_SW
 * @param  key: AES KEY pointer
 * @param  iv: AES IV pointer
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_AES_Set_Key_IV_BE(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Key_Src_Type keySrc, const uint8_t *key, const uint8_t *iv)
{
    uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
    uint32_t tmpVal;
    uint32_t keyType;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));
    CHECK_PARAM(IS_SEC_ENG_AES_KEY_SRC_TYPE(keySrc));

    /* Set IV */
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_0, BL_RDWD_FRM_BYTEP(iv));
    iv += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_1, BL_RDWD_FRM_BYTEP(iv));
    iv += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_2, BL_RDWD_FRM_BYTEP(iv));
    iv += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_IV_3, BL_RDWD_FRM_BYTEP(iv));
    iv += 4;

    /* Select hardware key */
    if (keySrc == SEC_ENG_AES_KEY_HW) {
        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_HW);
        BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_0, *key);
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_0, tmpVal);

        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_KEY_SEL_1, *key);
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_SEL_1, tmpVal);

        return;
    }

    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_0, BL_RDWD_FRM_BYTEP(key));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_1, BL_RDWD_FRM_BYTEP(key));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_2, BL_RDWD_FRM_BYTEP(key));
    key += 4;
    BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_3, BL_RDWD_FRM_BYTEP(key));
    key += 4;

    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
    keyType = BL_GET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_MODE);

    if (keyType == (uint32_t)SEC_ENG_AES_KEY_192BITS) {
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_4, BL_RDWD_FRM_BYTEP(key));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_5, BL_RDWD_FRM_BYTEP(key));
        key += 4;
    } else if (keyType == (uint32_t)SEC_ENG_AES_KEY_256BITS || keyType == (uint32_t)SEC_ENG_AES_DOUBLE_KEY_128BITS) {
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_4, BL_RDWD_FRM_BYTEP(key));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_5, BL_RDWD_FRM_BYTEP(key));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_6, BL_RDWD_FRM_BYTEP(key));
        key += 4;
        BL_WR_REG(AESx, SEC_ENG_SE_AES_KEY_7, BL_RDWD_FRM_BYTEP(key));
        key += 4;
    }

    /* Select software key */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_HW_KEY_EN, SEC_ENG_AES_KEY_SW);

    BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  AES set counter byte type in CTR mode
 *
 * @param  aesNo: AES ID type
 * @param  counterType: AES counter type
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_AES_Set_Counter_Byte(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Counter_Type counterType)
{
    uint32_t AESx = SEC_ENG_BASE;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_AES_ID_TYPE(aesNo));
    CHECK_PARAM(IS_SEC_ENG_AES_COUNTER_TYPE(counterType));

    /* Set counter type */
    tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_ENDIAN);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_0_ENDIAN, BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_0_CTR_LEN, counterType));
}

/****************************************************************************/ /**
 * @brief  AES encrypt or decrypt input data
 *
 * @param  aesCtx: AES context pointer
 * @param  aesNo: AES ID type
 * @param  in: AES input data buffer to deal with
 * @param  len: AES input data length
 * @param  out: AES output data buffer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_AES_Crypt(SEC_Eng_AES_Ctx *aesCtx, SEC_ENG_AES_ID_Type aesNo, const uint8_t *in, uint32_t len, uint8_t *out)
{
    uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
    uint32_t tmpVal;
    uint32_t timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

    if (len % 16 != 0) {
        return ERROR;
    }

    /* Wait finished */
    do {
        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_BUSY));

    /* Clear trigger */
    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_TRIG_1T);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

    /* Set input and output address */
    BL_WR_REG(AESx, SEC_ENG_SE_AES_MSA, (uint32_t)in);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_MDA, (uint32_t)out);

    /* Set message length */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_MSG_LEN, len / 16);

    if (aesCtx->mode == SEC_ENG_AES_CTR) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_DEC_KEY_SEL);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_DEC_KEY_SEL);
    }

    /* Set IV sel:0 for new, 1 for last */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_AES_IV_SEL, aesCtx->aesFeed);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

    /* Trigger AES Engine */
    tmpVal = BL_SET_REG_BIT(tmpVal, SEC_ENG_SE_AES_TRIG_1T);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_CTRL, tmpVal);

    /* Wait finished */
    timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

    do {
        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_BUSY));

    aesCtx->aesFeed = 1;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  AES finish function, clean register
 *
 * @param  aesNo: AES ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type Sec_Eng_AES_Finish(SEC_ENG_AES_ID_Type aesNo)
{
    uint32_t AESx = SEC_ENG_BASE + SEC_ENG_AES_OFFSET;
    uint32_t tmpVal;
    uint32_t timeoutCnt = SEC_ENG_AES_BUSY_TIMEOUT_COUNT;

    /* Wait finished */
    do {
        tmpVal = BL_RD_REG(AESx, SEC_ENG_SE_AES_CTRL);
        timeoutCnt--;

        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    } while (BL_IS_REG_BIT_SET(tmpVal, SEC_ENG_SE_AES_BUSY));

    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_EN);

    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_DEC_KEY_SEL);

    tmpVal = BL_CLR_REG_BIT(tmpVal, SEC_ENG_SE_AES_IV_SEL);

